---
kind: method
id: M:Autodesk.Revit.DB.SaveOptions.#ctor
source: html/37d21bdc-3655-22ba-268b-8bf66c844ed1.htm
---
# Autodesk.Revit.DB.SaveOptions.#ctor Method

Default constructor.

## Syntax (C#)
```csharp
public SaveOptions()
```

## Remarks
PreviewViewId will be InvalidElementId.